zup/ЗУП_бюджет/src/InformationRegisters/НастройкаПоказателейТарификацииМедРаботников/НастройкаПоказателейТарификацииМедРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПоказателейТарификацииМедРаботников</name>
  <resources>
    <name>ПоказательТарификации</name>
    <type>
      <types>EnumRef.ПоказателиТарификацииМедРаботников</types>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/CommonModules/ТарификационнаяОтчетностьУчрежденийФМБАВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Тарификационная отчетность в медицине".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ПоказателиРасчетаЗарплаты

Процедура ЗадатьСоответствиеПоказателяРасчетаЗарплатыПоказателюТарификации(Показатель, ПоказательТарификации) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкаПоказателейТарификацииМедРаботников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Показатель.Установить(Показатель);
	НаборЗаписей.Прочитать();
	
	Если ЗначениеЗаполнено(ПоказательТарификации) Тогда
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Если ПоказательТарификации = НаборЗаписей[0].ПоказательТарификации Тогда
				Возврат;
			КонецЕсли;
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.Показатель = Показатель;
		Запись.ПоказательТарификации = ПоказательТарификации;
		
	Иначе
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Возврат;
		Иначе
			НаборЗаписей.Удалить(НаборЗаписей[0]);
		КонецЕсли;
		
	КонецЕсли;
		
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
